app/controllers/forecast_controller.rb

  def index
    render :json => Hour.all.to_json, :callback => params['callback']
---
SELECT "hours".* FROM "hours"

  def current
    hour = Time.new().hour
    render :json => Hour.where(:hour => hour).order(:hour).to_json, :callback => params['callback']
---
SELECT "hours".* FROM "hours" WHERE "hours"."hour" = 9 ORDER BY hour