app/controllers/main_controller.rb

SELECT "hours".* FROM "hours" WHERE "hours"."hour" = 13 LIMIT 1
---
  def index
    hour = Time.new().hour
    @current = Hour.where(:hour => hour).first